devdnl/dnx-rtos/src/system/drivers/dma/drv/STM32F1F3/dma_ddi.h
/*=========================================================================*//**
@file    dma_ddi.h

@author  Daniel Zorychta

@brief   DMA Driver Direct Interface.

@note    Copyright (C) 2017 Daniel Zorychta <daniel.zorychta@gmail.com>

         This program is free software; you can redistribute it and/or modify
         it under the terms of the GNU General Public License as published by
         the Free Software Foundation and modified by the dnx RTOS exception.

         NOTE: The modification  to the GPL is  included to allow you to
               distribute a combined work that includes dnx RTOS without
               being obliged to provide the source  code for proprietary
               components outside of the dnx RTOS.

         The dnx RTOS  is  distributed  in the hope  that  it will be useful,
         but WITHOUT  ANY  WARRANTY;  without  even  the implied  warranty of
         MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
         GNU General Public License for more details.

         Full license text is available on the following file: doc/license.txt.


*//*==========================================================================*/

/**
 * @defgroup drv-dma-ddi DMA Driver Direct Interface.
 *
 * \section drv-dma-ddi-desc Description
 * DMA Driver Direct Interface. This interface can be used only from driver
 * level. Interface is created to provide common low-level functions that
 * handles basic microcontroller functionality. The interface of this driver
 * is not common for all architectures.
 *
 * \section drv-dma-sup-arch Supported architectures
 * \li stm32f4
 *
 * @todo Details
 *
 *
 * @{
 */

#ifndef _DMA_DDI_H_
#define _DMA_DDI_H_

#if defined(ARCH_stm32f1) || defined(ARCH_stm32f3)

/*==============================================================================
  Include files
==============================================================================*/
#include <sys/types.h>

#if defined(ARCH_stm32f1)
#include "stm32f1/stm32f10x.h"
#elif defined(ARCH_stm32f3)
#include "stm32f3/stm32f3xx.h"
#endif

#ifdef __cplusplus
extern "C" {
#endif

/*==============================================================================
  Exported macros
==============================================================================*/
#if defined(ARCH_stm32f1)
#define DMA_CCR_PL_1 DMA_CCR1_PL_1
#define DMA_CCR_PL_0 DMA_CCR1_PL_0
#define DMA_CCR_MSIZE_1 DMA_CCR1_MSIZE_1
#define DMA_CCR_MSIZE_0 DMA_CCR1_MSIZE_0
#define DMA_CCR_PSIZE_1 DMA_CCR1_PSIZE_1
#define DMA_CCR_PSIZE_0 DMA_CCR1_PSIZE_0
#define DMA_CCR_MINC DMA_CCR1_MINC
#define DMA_CCR_PINC DMA_CCR1_PINC
#define DMA_CCR_CIRC DMA_CCR1_CIRC
#define DMA_CCR_MEM2MEM DMA_CCR1_MEM2MEM
#define DMA_CCR_DIR DMA_CCR1_DIR
#endif

#define DMA_SR_GIF                      DMA_ISR_GIF1
#define DMA_SR_TCIF                     DMA_ISR_TCIF1
#define DMA_SR_HTIF                     DMA_ISR_HTIF1
#define DMA_SR_TEIF                     DMA_ISR_TEIF1

#define DMA_CCRx_PL_LOW                 ((0 * DMA_CCR_PL_1) | (0 * DMA_CCR_PL_0))
#define DMA_CCRx_PL_MEDIUM              ((0 * DMA_CCR_PL_1) | (1 * DMA_CCR_PL_0))
#define DMA_CCRx_PL_HIGH                ((1 * DMA_CCR_PL_1) | (0 * DMA_CCR_PL_0))
#define DMA_CCRx_PL_VERY_HIGH           ((1 * DMA_CCR_PL_1) | (1 * DMA_CCR_PL_0))

#define DMA_CCRx_MSIZE_BYTE             ((0 * DMA_CCR_MSIZE_1) | (0 * DMA_CCR_MSIZE_0))
#define DMA_CCRx_MSIZE_HALFWORD         ((0 * DMA_CCR_MSIZE_1) | (1 * DMA_CCR_MSIZE_0))
#define DMA_CCRx_MSIZE_WORD             ((1 * DMA_CCR_MSIZE_1) | (0 * DMA_CCR_MSIZE_0))

#define DMA_CCRx_PSIZE_BYTE             ((0 * DMA_CCR_PSIZE_1) | (0 * DMA_CCR_PSIZE_0))
#define DMA_CCRx_PSIZE_HALFWORD         ((0 * DMA_CCR_PSIZE_1) | (1 * DMA_CCR_PSIZE_0))
#define DMA_CCRx_PSIZE_WORD             ((1 * DMA_CCR_PSIZE_1) | (0 * DMA_CCR_PSIZE_0))

#define DMA_CCRx_MINC_FIXED             (0 * DMA_CCR_MINC)
#define DMA_CCRx_MINC_ENABLE            (1 * DMA_CCR_MINC)

#define DMA_CCRx_PINC_FIXED             (0 * DMA_CCR_PINC)
#define DMA_CCRx_PINC_ENABLE            (1 * DMA_CCR_PINC)

#define DMA_CCRx_CIRC_DISABLE           (0 * DMA_CCR_CIRC)
#define DMA_CCRx_CIRC_ENABLE            (1 * DMA_CCR_CIRC)

#define DMA_CCRx_DIR_P2M                ((0 * DMA_CCR_MEM2MEM) | (0 * DMA_CCR_DIR))
#define DMA_CCRx_DIR_M2P                ((0 * DMA_CCR_MEM2MEM) | (1 * DMA_CCR_DIR))
#define DMA_CCRx_DIR_M2M                ((1 * DMA_CCR_MEM2MEM) | (0 * DMA_CCR_DIR))

/*==============================================================================
  Exported object types
==============================================================================*/
typedef bool (*_DMA_cb_t)(DMA_Channel_TypeDef *channel, u8_t SR, void *arg);

typedef struct {
        void     *arg;          /*! user configuration: callback argument */
        _DMA_cb_t cb_finish;    /*! user configuration: finish callback */
        _DMA_cb_t cb_half;      /*! user configuration: half transfer callback */
        _DMA_cb_t cb_next;      /*! user configuration: next callback */
        u32_t     CR;           /*! user configuration: control register */
        u32_t     NDT;          /*! user configuration: data number */
        u32_t     PA;           /*! user configuration: peripheral address */
        u32_t     MA;           /*! user configuration: memory address */
        bool      release;      /*! user configuration: automatically release stream */
        uint32_t  IRQ_priority; /*! user configuration: IRQ priority */
} _DMA_DDI_config_t;

/*==============================================================================
  Exported objects
==============================================================================*/

/*==============================================================================
  Exported functions
==============================================================================*/
//==============================================================================
/**
 * @brief Function allocate selected stream.
 *
 * @param [in]  major         DMA peripheral number.
 * @param [in]  channel       channel number [1..7].
 *
 * @return On success DMA descriptor number, otherwise 0.
 */
//==============================================================================
extern u32_t _DMA_DDI_reserve(u8_t major, u8_t channel);

//==============================================================================
/**
 * @brief Function free allocated stream.
 *
 * @param dmad                  DMA descriptor.
 */
//==============================================================================
extern void _DMA_DDI_release(u32_t dmad);

//==============================================================================
/**
 * @brief Function start transfer. The IRQ flags (TCIE, TEIE) are added
 *        automatically.
 *
 * @param dmad                  DMA descriptor.
 * @param config                DMA configuration.
 *
 * @return One of errno value.
 */
//==============================================================================
extern int _DMA_DDI_transfer(u32_t dmad, _DMA_DDI_config_t *config);

//==============================================================================
/**
 * @brief Function return DMA channel according to DMA descriptor.
 *
 * @param dmad                  DMA descriptor.
 * @param channel               stream
 *
 * @return One of errno value.
 */
//==============================================================================
extern int _DMA_DDI_get_channel(u32_t dmad, DMA_Channel_TypeDef **channel);

//==============================================================================
/**
 * @brief Function start memory-to-memory transfer by using free channel.
 *
 * @param dst                   destination address.
 * @param src                   source address.
 * @param size                  block size.
 *
 * @return One of errno value.
 */
//==============================================================================
extern int _DMA_DDI_memcpy(void *dst, const void *src, size_t size);

/*==============================================================================
  Exported inline functions
==============================================================================*/

#ifdef __cplusplus
}
#endif

#endif /* ARCH_stm32f1 */
#endif /* _DMA_DDI_H_ */
/**@}*/
/*==============================================================================
  End of file
==============================================================================*/
